use superbus;

-- Додавання даних у таблицю t_user
INSERT INTO t_user (name, email, phone, password_hash, role)
VALUES
('Іван Петренко', 'ivan.petrenko@example.com', '+380631234567', 'hashedpassword1', 'CLIENT'),
('Олена Іванова', 'olena.ivanova@example.com', '+380971234567', 'hashedpassword2', 'CLIENT'),
('Транспортна Компанія 1', 'company1@example.com', '+380501234567', 'hashedpassword3', 'PARTNER'),
('Транспортна Компанія 2', 'company2@example.com', '+380671234567', 'hashedpassword4', 'PARTNER'),
('Марія Сидорова', 'maria.sidorova@example.com', '+380681234567', 'hashedpassword5', 'CLIENT'),
('Петро Коваль', 'petro.koval@example.com', '+380691234567', 'hashedpassword6', 'CLIENT'),
('Транспортна Компанія 3', 'company3@example.com', '+380551234567', 'hashedpassword7', 'PARTNER'),
('Транспортна Компанія 4', 'company4@example.com', '+380661234567', 'hashedpassword8', 'PARTNER'),
('Олександр Іванчук', 'oleksandr.ivanchuk@example.com', '+380511234567', 'hashedpassword9', 'CLIENT'),
('Світлана Мельник', 'svitlana.melnik@example.com', '+380761234567', 'hashedpassword10', 'CLIENT'),
('Транспортна Компанія 5', 'company5@example.com', '+380571234567', 'hashedpassword11', 'PARTNER'),
('Транспортна Компанія 6', 'company6@example.com', '+380681234567', 'hashedpassword12', 'PARTNER');

INSERT INTO t_route (start_location, end_location, description, price, partner_id)
VALUES
('Київ', 'Львів', 'Швидкісне перевезення між Києвом та Львовом', 500.00, 3),
('Харків', 'Одеса', 'Нічний рейс з Харкова до Одеси', 800.00, 4),
('Дніпро', 'Запоріжжя', 'Щоденний рейс між Дніпром та Запоріжжям', 400.00, 5),
('Івано-Франківськ', 'Чернівці', 'Подорож через Карпати', 650.00, 6),
('Полтава', 'Миколаїв', 'Рейс через Одеську область', 750.00, 7),
('Київ', 'Одеса', 'Швидке перевезення з Києва до Одеси', 600.00, 8),
('Харків', 'Кременчук', 'Експрес рейс Харків-Кременчук', 450.00, 9),
('Луцьк', 'Рівне', 'Підйом у горах з Луцька до Рівного', 500.00, 10),
('Черкаси', 'Кропивницький', 'Пасажирський рейс Черкаси-Кропивницький', 550.00, 11),
('Житомир', 'Тернопіль', 'Мандрівка по Західній Україні', 400.00, 12);

INSERT INTO t_stop (route_id, location_name, arrival_time, departure_time)
VALUES
(1, 'Житомир', '2024-11-15 10:00:00', '2024-11-15 10:15:00'),
(1, 'Тернопіль', '2024-11-15 14:00:00', '2024-11-15 14:15:00'),
(2, 'Дніпро', '2024-11-16 22:00:00', '2024-11-16 22:15:00'),
(3, 'Запоріжжя', '2024-11-17 08:00:00', '2024-11-17 08:15:00'),
(3, 'Кам`янка', '2024-11-17 10:00:00', '2024-11-17 10:15:00'),
(4, 'Івано-Франківськ', '2024-11-17 12:00:00', '2024-11-17 12:15:00'),
(4, 'Чернівці', '2024-11-17 14:00:00', '2024-11-17 14:15:00'),
(5, 'Полтава', '2024-11-18 06:00:00', '2024-11-18 06:15:00'),
(5, 'Миколаїв', '2024-11-18 10:00:00', '2024-11-18 10:15:00'),
(6, 'Київ', '2024-11-18 18:00:00', '2024-11-18 18:15:00'),
(6, 'Одеса', '2024-11-18 20:00:00', '2024-11-18 20:15:00'),
(7, 'Харків', '2024-11-19 00:00:00', '2024-11-19 00:15:00'),
(7, 'Кременчук', '2024-11-19 04:00:00', '2024-11-19 04:15:00');


INSERT INTO t_ticket (user_id, route_id, purchase_date, status, route_name, seats, price)
VALUES
(1, 1, '2024-11-12 08:00:00', 'куплений', 'Київ-Львів', 1, 500),
(2, 2, '2024-11-12 09:00:00', 'куплений', 'Харків-Одеса', 2, 1000),
(3, 3, '2024-11-13 10:00:00', 'куплений', 'Дніпро-Запоріжжя', 1, 300),
(4, 4, '2024-11-13 11:00:00', 'куплений', 'Івано-Франківськ-Чернівці', 3, 400),
(5, 5, '2024-11-14 09:30:00', 'куплений', 'Полтава-Миколаїв', 2, 600),
(6, 6, '2024-11-14 10:00:00', 'куплений', 'Київ-Одеса', 4, 800),
(7, 7, '2024-11-14 12:00:00', 'куплений', 'Харків-Кременчук', 1, 700),
(8, 8, '2024-11-15 13:00:00', 'куплений', 'Луцьк-Рівне', 3, 900),
(9, 9, '2024-11-15 14:30:00', 'куплений', 'Черкаси-Кропивницький', 2, 100),
(10, 10, '2024-11-16 15:00:00', 'куплений', 'Житомир-Тернопіль', 1, 300);
